python 解决中文问题
只需要在.py文件的第一行中添加
第一种方式 #-*-coding:UTF-8-*-
第二种方式 #coding=utf-8

字符串
方法 len() 
s[0] s[-1]//正向索引是从左边开始计算，反向索引是从右边开始计算
s[1:3]//分片操作但是不包括第二个数字的值
分片操作中左边默认是0
upper()把小写转化为大写
isalpha() 方法检测字符串是否只由字母组成
 rstrip() 删除 string 字符串末尾的指定字符（默认为空格）
'%s,egg,and %s'%('spam','SPAM')
'{0,eggs,and {1}'.format('spam','SPAM')

序列的操作//没有固定类型的操作，没有固定大小
追加使用append()
删除使用pop(1)//给出指定的偏移量
sort()//排序
reverse()//翻转

python 垃圾收集

当使用for循环的时候下一行输出print的时候应该先敲一个空格或者tap键进行缩进

元组 //不可改变的列表和字符串类似编写在圆括号中

count()//方法用于统计字符串里某个字符出现的次数。可选参数为在字符串搜索的开始与结束位置
